////////// st076569_9 ////////////////////////////////////////////////////////
// Автор  : Баталов Семен                                                   //
// Дата   : 15.10.2020                                                      //
// Задача : Используя псевдопараллелизм Linux, запустить параллельно        //
//          несколько одинаковых программ.                                  //
//////////////////////////////////////////////////////////////////////////////

#include "functions.h"

int main()
{
    bat::run();
    
    return 0;
}
